<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/%EB%B9%85%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('EX_GrapeData.csv')

In [ ]:
df.head()

   continent  brand  size  period price
0          2      2  10.7   47.65   144
1          2      3  14.0   63.13   215
2          2      2   9.0   58.76   105
3          1      1   8.0   34.88    69
4          2      2  10.0   55.53   134

In [ ]:
recode_brand = {"brand" : {1 : 1, 2: 1, 3: 2}}

In [ ]:
df.replace(recode_brand, inplace = True)

In [ ]:
df.head()

   continent  brand  size  period price
0          2      1  10.7   47.65   144
1          2      2  14.0   63.13   215
2          2      1   9.0   58.76   105
3          1      1   8.0   34.88    69
4          2      1  10.0   55.53   134

In [ ]:
df[['brand']]

    brand
0       1
1       2
2       1
3       1
4       1
..    ...
58      1
59      1
60      1
61      2
62      2

[63 rows x 1 columns]

In [ ]:
df = pd.read_csv('EX_GrapeData.csv')

In [ ]:
def brand_groups(series):
  if series == 1:
    return 1
  elif series == 2:
    return 1
  elif series == 3:
    return 2

df['re_brand'] = df['brand'].apply(brand_groups)

In [ ]:
df.head()

   continent  brand  size  period price  re_brand
0          2      2  10.7   47.65   144         1
1          2      3  14.0   63.13   215         2
2          2      2   9.0   58.76   105         1
3          1      1   8.0   34.88    69         1
4          2      2  10.0   55.53   134         1

In [ ]:
d